app/controllers/contracts_controller.rb

  def new
    @contract = Contract.new
    @venues = Venue.all
    @companies = Company.all
---
SELECT "venues".* FROM "venues"
SELECT "companies".* FROM "companies"