app/controllers/designers_controller.rb

  def create
    designer_check = Designer.new(designer_params).save
    if designer_check
      @designer = Designer.last
---
INSERT INTO "designers" ("gender", "created_at", "updated_at", "username", "password_digest", "birth_year") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "designers".* FROM "designers" ORDER BY "designers"."id" DESC LIMIT ?  [["LIMIT", 1]]