app/controllers/sessions_controller.rb

SELECT  "designers".* FROM "designers" WHERE "designers"."username" = ? LIMIT ?  [["username", "oiajsdoiajsd"], ["LIMIT", 1]]
---
  def create
    @designer = Designer.find_by(username: params[:designer][:username])